OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example6/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
touch mesh.foam
runApplication blockMesh
runApplication setFields

runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
